### Pandas basic API training (summary)

#### __Reviews__

* __pandas.read_csv(')__ : csv file 불러오기. sep 인자를 콤마가 아닌 다른 분리자로 변경하면 다른 유형의 파일도 로드 가능
  
* __pandas.DataFrame(',columns = , index =)__ : 행렬 형태의 pandas dataframe 생성. list, numpy.array, dictionary 모두 인자로 받을 수 있음.
* __pandas.Series(')__ : 벡터 형태의 pandas series 생성
* __pandas.DataFrame(').head()__ : dataframe의 맨 앞 5개의 row 값 확인
* __pandas.DataFrame(').columns / .index / .values__ : dataframe의 컬럼명, 인덱스, 그리고 dataframe 내의 원소값들을 추출
* __pandas.DataFrame(')['column name'] / [['column name']]__ : dataframe의 컬럼 필터링. 첫번째의 경우 Series 자료형으로 저장 가능, 두번째는 dataframe 자료형으로 저장됨.
* __pandas.DataFrame(').shape__ : dataframe의 shape. numpy의 shape와 같은 기능
* __pandas.DataFrame(').info()__ : 컬럼명, 데이터 타입, Null 건수, 데이터 건수 정보 제공
* __pandas.DataFrame(').describe()__ : dataframe 내 원소값들의 평균, 표준편차, 4분위 분포도 제공.
* __pandas.Series(').value_counts()__ : Series 내의 동일한 개별 데이터 값의 분포도(건수) 제공.
* __pandas.DataFrame(').sort_values(by = , ascending =)__ : dataframe 내 데이터 값 정렬. by = 정렬컬럼(여러개 정렬은 list 형태로), ascending = True는 오름차순.
* __pandas.DataFrame(').values / .values.tolist() / .to_dict()__ : 각각 array변환, list변환, dictionary변환
* __pandas.DataFrame(').drop(labels = None,axis = 0,inplace = False)__ : dataframe의 특정 행이나 열 삭제. inplace = 는 원본에 drop된 결과 적용인 경우 True.
* __pandas data selection and filtering__ : 1. 컬럼 기반 필터링 or boolean 인덱싱 필터링 제공, 2. ix[] (명칭/위치 기반 인덱싱),loc[] (명칭기반, 'column'),iloc[] (위치기반, 0,1,2..) 인덱싱 제공.
* __pandas.DataFrame(') / .Series(').sum() / .min() / .max() / .count()__ : pandas Aggregation 함수들 제공
* __pandas.DataFrame(').groupby(by = 'column name' or ['c1','c2',..]).AggregationFunction()__ : 특정 컬럼을 기준으로 묶어 내용 제시. 보통 특정 aggregation function을 함께 이용
* __pandas.DataFrame(').groupby().agg([aggregationfn1,aggregationfn2,..])__ : 여러개의 aggregation function을 사용하고자 할 경우 .agg() 이용. dict = {'col1':'max', 'col2':mean} 와 같이 dictionary를 이용하여 agg()에 넣어주어도 됨
* __pandas.DataFrame(').isna()__ : 주어진 컬럼값들이 NaN인 경우 True, 아니면 False 반환. isna().sum()을 사용하게 되면 NaN 건수를 구할 수 있음.
* __pandas.DataFrame(').fillna(대체값)__ : missing 데이터를 인자로 주어진 값으로 대체
* __pandas.DataFrame(').apply(lambda x: funtion of x)__ : 람다식 이용해서 데이터 가공

In [1]:
# import pandas package
import pandas as pd

In [4]:
df = pd.read_csv('train.csv')
df.head() # summary of df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
D = {'Students': ['pandemic','epidemic','endemic'],'Score':[80,100,36]}
studentdata = pd.DataFrame(D,columns = ['Students','Score'])
print(studentdata)

   Students  Score
0  pandemic     80
1  epidemic    100
2   endemic     36

In [23]:
S = pd.Series([1,3,4,5,7,8,9,10]) # generate Series
print(S) 
S = studentdata['Students']
print(type(S))
S = studentdata[['Students']]
print(type(S))

0     1
1     3
2     4
3     5
4     7
5     8
6     9
7    10
dtype: int64
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [18]:
print('-'*70)
print(df.columns)
print('-'*70)
print(df.index)
print('-'*70)
print(df.values)
print('-'*70)
print(df.shape)

----------------------------------------------------------------------
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
----------------------------------------------------------------------
RangeIndex(start=0, stop=891, step=1)
----------------------------------------------------------------------
[[1 0 3 ... 7.25 nan 'S']
 [2 1 1 ... 71.2833 'C85' 'C']
 [3 1 3 ... 7.925 nan 'S']
 ...
 [889 0 3 ... 23.45 nan 'S']
 [890 1 1 ... 30.0 'C148' 'C']
 [891 0 3 ... 7.75 nan 'Q']]
----------------------------------------------------------------------
(891, 12)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [20]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [22]:
S = studentdata['Score'].value_counts()
print(S)

36     1
100    1
80     1
Name: Score, dtype: int64

In [25]:
studentdata.sort_values(by = 'Score')

   Students  Score
2   endemic     36
0  pandemic     80
1  epidemic    100

In [30]:
studentdata.drop(labels = 1,axis = 0, inplace = False)

   Students  Score
0  pandemic     80
2   endemic     36

In [38]:
print(studentdata.iloc[0][1])
print(studentdata.ix[1,'Score'])

80
100

C:\Users\92nor\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated

In [42]:
print(df.sum())
print(df.isna().count())

PassengerId                                               397386
Survived                                                     342
Pclass                                                      2057
Name           Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
Sex            malefemalefemalefemalemalemalemalemalefemalefe...
Age                                                      21205.2
SibSp                                                        466
Parch                                                        340
Ticket         A/5 21171PC 17599STON/O2. 31012821138033734503...
Fare                                                     28693.9
dtype: object
PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            891
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          891
Embarked       891
dtype: int64

In [44]:
studentdata['Score'].apply(lambda x : x-100)

0   -20
1     0
2   -64
Name: Score, dtype: int64

In [47]:
df.groupby(by = 'Pclass').count()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491